In [22]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [23]:
df = pd.read_csv("C:/Users/Shreshtha/Downloads/data.csv")

In [31]:
df

,Number,City,Colors Reported,Shape Reported,State,Time
0,123456.0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,54321.0,Willingboro,green,NaN,NJ,6/30/1930 20:00
2,87654.0,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3456.0,Abilene,blue,DISK,KS,1/12/1900 0:00
4,7654.0,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
5,NaN,Valley City,NaN,NaN,N,9/15/1934 15:30
6,87654.0,Crater Lake,yellow,CIRCLE,CA,6/15/1935 0:00
7,6789.0,Alma,NaN,DISK,MI,7/15/1936 0:00
8,NaN,Eklutna,green,12,AK,10/15/1936 17:00
9,4567.0,Hubbard,red,CYLINDER,NaN,6/15/1937 0:00
10,7654.0,Fontana,NaN,LIGHT,CA,8/15/1937 21:00
11,NaN,Waterloo,NaN,FIREBALL,AL,6/1/1939 20:00
12,6543.0,Belton,red,SPHERE,Y,6/30/1939 20:00
13,876.0,Keokuk,NaN,@,IA,7/7/1939 2:00
14,5432.0,Ludington,NaN,DISK,MI,6/1/1941 13:00
19,6543.0,Belton,red,???,Y,6/30/1939 20:00
20,876.0,Keokuk,not known,@,IA,7/7/1939 2:00
21,5432.0,Ludington,*****,DISK,MI,6/1/1941 13:00

In [29]:
df.shape

(18, 6)

In [25]:
dupes = df.duplicated()
sum(dupes)

13

In [28]:
df = df.drop_duplicates()  
df

,Number,City,Colors Reported,Shape Reported,State,Time
0,123456.0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,54321.0,Willingboro,green,NaN,NJ,6/30/1930 20:00
2,87654.0,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3456.0,Abilene,blue,DISK,KS,1/12/1900 0:00
4,7654.0,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
5,NaN,Valley City,NaN,NaN,N,9/15/1934 15:30
6,87654.0,Crater Lake,yellow,CIRCLE,CA,6/15/1935 0:00
7,6789.0,Alma,NaN,DISK,MI,7/15/1936 0:00
8,NaN,Eklutna,green,12,AK,10/15/1936 17:00
9,4567.0,Hubbard,red,CYLINDER,NaN,6/15/1937 0:00
10,7654.0,Fontana,NaN,LIGHT,CA,8/15/1937 21:00
11,NaN,Waterloo,NaN,FIREBALL,AL,6/1/1939 20:00
12,6543.0,Belton,red,SPHERE,Y,6/30/1939 20:00
13,876.0,Keokuk,NaN,@,IA,7/7/1939 2:00
14,5432.0,Ludington,NaN,DISK,MI,6/1/1941 13:00
19,6543.0,Belton,red,???,Y,6/30/1939 20:00
20,876.0,Keokuk,not known,@,IA,7/7/1939 2:00
21,5432.0,Ludington,*****,DISK,MI,6/1/1941 13:00

In [30]:
df.shape

(18, 6)

In [32]:
dupes = df.duplicated()
sum(dupes)

0